---
kind: property
id: P:Autodesk.Revit.DB.CurveArray.IsEmpty
source: html/c7b2b921-475a-ed42-f800-0907257b534f.htm
---
# Autodesk.Revit.DB.CurveArray.IsEmpty Property

Test to see if the array is empty.

## Syntax (C#)
```csharp
public virtual bool IsEmpty { get; }
```

## Remarks
If the array is empty then True will be returned, otherwise False.